
DROP TABLE IF EXISTS `t_case`;
CREATE TABLE `t_case` (
  `id` int(5) auto_increment,
  `place` text,
  `log` float(5),
  `lat` float(5),
  `police_id` int(6),
  `happentime` datetime,
  `car_id` char(6),
  `drive_card` bigint(12),
  `content` text,
  `cost` int(3),
  `score` int(3),
  `law_id` int(5),
  `punishment` text,
  `infoway` enum('现场执法','非现场执法'),
  `state` enum('未处理','已处理','申诉','修正','销毁','审核'),
  `handletime` datetime,
  foreign key(police_id) references t_police(id),
  foreign key(car_id) references t_car(id),
  foreign key(law_id) references t_law(id),
  PRIMARY KEY (`id`)
)  ENGINE=myisam AUTO_INCREMENT=1 CHARSET=utf8;

-- ----------------------------
-- Records of t_case
-- ----------------------------

INSERT INTO `t_case` VALUES 
(null, '上海新村', 100,25,1,'2015-01-03 10:12:11','闽A0001',321687987855,'违章变道',50,3,'','罚款','现场执法','未处理',''),
(null, '金牛山公园', 100,25,1,'2015-01-03 10:12:11','闽A0001',840055586791,'违章停车',50,3,'','罚款','现场执法','修正',''),
(null, '洪山桥', 100,25,1,'2015-01-03 10:12:11','闽C0015',587956841254,'超速50%',50,6,'','罚款','现场执法','未处理',''),
(null, '巴拉拉小魔仙的家', 100,25,1,'2015-01-03 10:12:11',321875568755,'闽D0010','违章停车',50,3,'','罚款','现场执法','未处理',''),
(null, '铜盘新村', 100,25,1,'2015-01-03 10:12:11','闽C0021',321875568755,'违章变道',50,3,'','罚款','现场执法','申诉',''),
(null, '甘蔗小区', 100,25,1,'2015-01-03 10:12:11','闽A0001',321465792357,'醉酒驾车',0,1,'','警告','现场执法','审核',''),
(null, '省府路口', 100,25,1,'2015-01-03 10:12:11','闽E0017',840055586791,'违章停车',50,3,'','罚款','现场执法','申诉',''),
(null, '普陀山', 100,25,1,'2015-01-03 10:12:11','闽B0002',687984525879,'压实线',0,1,'','拘留','现场执法','已处理',''),
(null, '东街口', 100,25,1,'2015-01-03 10:12:11','闽A0001',580285891258,'违章变道',50,6,'','罚款','现场执法','申诉',''),
(null, '五四路口', 100,25,1,'2015-01-03 10:12:11','闽A0001',587956841254,'违章停车',50,3,'','罚款','现场执法','审核',''),
(null, '省立医院', 100,25,1,'2015-01-03 10:12:11','闽A0007',987426254212,'违章停车',50,3,'','罚款','现场执法','申诉',''),
(null, '仓山万达', 100,25,1,'2015-01-03 10:12:11','闽C0009',321687987855,'酒后驾车',50,1,'','罚款','现场执法','修正',''),
(null, '福建农林大学', 100,25,1,'2015-01-03 10:12:11','闽A0001',388459952778,'超速',50,3,'','罚款','现场执法','修正','');

